In [1]:
import pandas as pd
import numpy as np
d={
    'Name':['Anitha','Bobby','Raghavendra','Mamatha','Madhusudhan','Seema','Sowmya','Rahul','Manoj',
           'Mounika','Ajay','Sundar'],
    'Score1':[62,47,55,74,31,77,85,63,42,32,71,57],
    'Score2':[89,87,67,55,47,72,76,79,44,92,99,69],
    'Score3':[56,86,77,45,73,62,74,89,71,67,97,68],
}
df=pd.DataFrame(d)

In [2]:
df

           Name  Score1  Score2  Score3
0        Anitha      62      89      56
1         Bobby      47      87      86
2   Raghavendra      55      67      77
3       Mamatha      74      55      45
4   Madhusudhan      31      47      73
5         Seema      77      72      62
6        Sowmya      85      76      74
7         Rahul      63      79      89
8         Manoj      42      44      71
9       Mounika      32      92      67
10         Ajay      71      99      97
11       Sundar      57      69      68

In [3]:
df.mean()

Score1    58.000000
Score2    73.000000
Score3    72.083333
dtype: float64

In [4]:
df.var()

Score1    304.363636
Score2    311.636364
Score3    206.083333
dtype: float64

In [8]:
df.var(axis=1)

0     309.000000
1     520.333333
2     121.333333
3     217.000000
4     449.333333
5      58.333333
6      34.333333
7     172.000000
8     262.333333
9     908.333333
10    244.000000
11     44.333333
dtype: float64

In [9]:
df.loc[:,"Score1"].var()

304.3636363636364

In [10]:
import pandas as pd  
import numpy as np    
info = {  
    'Name':['Manvitha','Surah','Jahanavi','Sonam'],  
   'sub1_Marks':[52,38,42,37],  
   'sub2_Marks':[41,35,29,36]}   
data = pd.DataFrame(info)

In [11]:
data

       Name  sub1_Marks  sub2_Marks
0  Manvitha          52          41
1     Surah          38          35
2  Jahanavi          42          29
3     Sonam          37          36

In [12]:
data.std()

sub1_Marks    6.849574
sub2_Marks    4.924429
dtype: float64

In [13]:
data.std(axis=1)

0    7.778175
1    2.121320
2    9.192388
3    0.707107
dtype: float64

In [14]:
import pandas as pd
dataVal = [(10,20,30,40,50,60,70),
           (10,10,40,40,50,60,70),
           (10,20,30,50,50,60,80)]
dataFrame = pd.DataFrame(data=dataVal, index=['R1','R2','R3'], columns=['C1','C2','C3','C4','C5','C6','C7']);
print("DataFrame:")
print(dataFrame)
print("\n\nSkew over rows")
skewValue = dataFrame.skew(axis=1)
print(skewValue)
print("\n\nSkew over columns")
skewValue = dataFrame.skew(axis=0)
print(skewValue)

DataFrame:
    C1  C2  C3  C4  C5  C6  C7
R1  10  20  30  40  50  60  70
R2  10  10  40  40  50  60  70
R3  10  20  30  50  50  60  80


Skew over rows
R1    0.000000
R2   -0.340998
R3    0.121467
dtype: float64


Skew over columns
C1    0.000000
C2   -1.732051
C3    1.732051
C4    1.732051
C5    0.000000
C6    0.000000
C7    1.732051
dtype: float64

In [15]:
import pandas as pd  
df = pd.DataFrame({"A":[1, 5, 3, 4], 
                "B":[3, 2, 4, 3], 
                "C":[2, 2, 7, 3]}) 
print("Printing the data frame ")
print(df)
print("\n\n") 
quantrange=[.1, .25, .5, .75]
print("\nPrinting the following quantiles  of data frame along columns", quantrange)
print(df.quantile(quantrange, axis = 0) )

Printing the data frame
   A  B  C
0  1  3  2
1  5  2  2
2  3  4  7
3  4  3  3




Printing the following quantiles  of data frame along columns [0.1, 0.25, 0.5, 0.75]
         A     B    C
0.10  1.60  2.30  2.0
0.25  2.50  2.75  2.0
0.50  3.50  3.00  2.5
0.75  4.25  3.25  4.0

In [16]:
df = pd.DataFrame(np.random.random((5,4)), index=pd.Series(range(1,6), name="week"), columns=["City{}".format(i) for i in range(1,5)])
print("Printing dataframe:\n")
print(df)
print("\nPrinting range for each column in dataframe:\n\n")
print(df.max() - df.min())

Printing dataframe:

         City1     City2     City3     City4
week
1     0.858499  0.349754  0.839588  0.389526
2     0.841460  0.971050  0.456283  0.457071
3     0.049395  0.384681  0.569185  0.635438
4     0.580852  0.399969  0.236097  0.283847
5     0.173564  0.835375  0.249659  0.243165

Printing range for each column in dataframe:


City1    0.809104
City2    0.621296
City3    0.603491
City4    0.392273
dtype: float64